In [1]:
import pandas as pd
import numpy as np

In [ ]:
#Construct a DataFrame from a dictionary of lists

In [2]:
data = {'ProductName': ['Product A', 'Product B','Product C'], 'ProductPrice': [125, 200, 300]}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A           125
1   Product B           200
2   Product C           300

In [3]:
data = {'ProductName': ['Product A', 'Product B','Product C', 'Product D'], 'ProductPrice': [125, 200, 300, 150]}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A           125
1   Product B           200
2   Product C           300
3   Product D           150

In [ ]:
#Construct a DataFrame from a dictionary of lists + specify an index

In [4]:
data = {'ProductName': ['Product A', 'Product B','Product C'], 'ProductPrice': [125, 200, 300]}
product_IDs = ['A', 'B', 'C']
df = pd.DataFrame(data, index = product_IDs)
df

  ProductName  ProductPrice
A   Product A           125
B   Product B           200
C   Product C           300

In [ ]:
#Construct a DataFrame from a list of dictionaries

In [5]:
data = [{'ProductName': 'Product A', 'ProductPrice': 150}, 
        {'ProductName': 'Product B', 'ProductPrice': 50}, 
        {'ProductName': 'Product C', 'ProductPrice': 250}]
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A           150
1   Product B            50
2   Product C           250

In [6]:
data = [{'ProductName': 'Product A', 'ProductPrice': 150}, 
        {'ProductName': 'Product B', 'ProductPrice': 50}, 
        {'ProductName': 'Product C', 'ProductPrice': [100, 250]}]
df = pd.DataFrame(data)
df

  ProductName ProductPrice
0   Product A          150
1   Product B           50
2   Product C   [100, 250]

In [ ]:
#Construct a DataFrame from a dictionary of pandas Series

In [7]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'])
ser_prices = pd.Series([22250, 16600, 12500])

In [8]:
data = {'ProductName': ser_products, 'ProductPrice': ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [9]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500], index = ['A', 'B', 'C'])

data = {'ProductName': ser_products, 'ProductPrice': ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [10]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500], index = [ 'B', 'A','C'])

data = {'ProductName': ser_products, 'ProductPrice': ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         16600
B   Product B         22250
C   Product C         12500

In [11]:
#Construct a DataFrame from a list of lists

In [12]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [13]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500, 56]]
df = pd.DataFrame(data)
df

           0      1     2
0  Product A  22250   NaN
1  Product B  16600   NaN
2  Product C  12500  56.0

In [14]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [15]:
df.columns = ['ProductName', 'ProductPrice']
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [16]:
df.index = ['a', 'b', 'c']
df

  ProductName  ProductPrice
a   Product A         22250
b   Product B         16600
c   Product C         12500

In [17]:
#Construct a DataFrame in a professional way

In [18]:
df = pd.DataFrame(data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]], 
                  columns = ['ProductName', 'ProductPrice'],
                  index = ['A', 'B', 'C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [19]:
df.shape

(3, 2)

In [22]:
import pandas as pd

names = pd.Series(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'])
age = pd.Series([50, 53, 35, 43])
working_experience_yrs = pd.Series([5, 8, 3, 10])

data = {'Name': names, 'Age': age, 'Working Experience (Yrs.)': working_experience_yrs}
df = pd.DataFrame(data)
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

In [23]:
import pandas as pd
data = {
    "Name":['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], 
    "Age":[50, 53, 35, 43], 
    "Working Experience (Yrs.)":[5,8,3,10]}
names_ids = [1, 2, 3, 4]
df = pd.DataFrame(data,  index = names_ids)
print(df)

                 Name  Age  Working Experience (Yrs.)
1           Amy White   50                          5
2        Jack Stewart   53                          8
3  Richard Lauderdale   35                          3
4        Sara Johnson   43                         10